; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-5-2)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	)
(:init
	(at plane1 city3)
	(= (capacity plane1) 2294)
	(= (fuel plane1) 289)
	(= (slow-burn plane1) 1)
	(= (fast-burn plane1) 3)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 9)
	(at plane2 city1)
	(= (capacity plane2) 7130)
	(= (fuel plane2) 29)
	(= (slow-burn plane2) 3)
	(= (fast-burn plane2) 9)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 8)
	(at plane3 city5)
	(= (capacity plane3) 2124)
	(= (fuel plane3) 629)
	(= (slow-burn plane3) 1)
	(= (fast-burn plane3) 3)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 9)
	(at plane4 city4)
	(= (capacity plane4) 5980)
	(= (fuel plane4) 742)
	(= (slow-burn plane4) 2)
	(= (fast-burn plane4) 4)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 4)
	(at plane5 city1)
	(= (capacity plane5) 9578)
	(= (fuel plane5) 1924)
	(= (slow-burn plane5) 4)
	(= (fast-burn plane5) 9)
	(= (onboard plane5) 0)
	(= (zoom-limit plane5) 2)
	(at person1 city6)
	(at person2 city6)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 614)
	(= (distance city0 city2) 934)
	(= (distance city0 city3) 777)
	(= (distance city0 city4) 788)
	(= (distance city0 city5) 997)
	(= (distance city0 city6) 797)
	(= (distance city1 city0) 614)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 899)
	(= (distance city1 city3) 909)
	(= (distance city1 city4) 814)
	(= (distance city1 city5) 751)
	(= (distance city1 city6) 873)
	(= (distance city2 city0) 934)
	(= (distance city2 city1) 899)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 907)
	(= (distance city2 city4) 997)
	(= (distance city2 city5) 754)
	(= (distance city2 city6) 849)
	(= (distance city3 city0) 777)
	(= (distance city3 city1) 909)
	(= (distance city3 city2) 907)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 618)
	(= (distance city3 city5) 697)
	(= (distance city3 city6) 934)
	(= (distance city4 city0) 788)
	(= (distance city4 city1) 814)
	(= (distance city4 city2) 997)
	(= (distance city4 city3) 618)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 617)
	(= (distance city4 city6) 645)
	(= (distance city5 city0) 997)
	(= (distance city5 city1) 751)
	(= (distance city5 city2) 754)
	(= (distance city5 city3) 697)
	(= (distance city5 city4) 617)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 800)
	(= (distance city6 city0) 797)
	(= (distance city6 city1) 873)
	(= (distance city6 city2) 849)
	(= (distance city6 city3) 934)
	(= (distance city6 city4) 645)
	(= (distance city6 city5) 800)
	(= (distance city6 city6) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city0)
	(at plane3 city1)
	(at person1 city0)
	(at person2 city2)
	))

(:metric minimize (+ (* 1 (total-time))  (* 3 (total-fuel-used))))
)

; plan
1. (refuel plane1 city3)
   changed: (fuel plane1) from 289 to 2294
   goals met: 0 of 4
2. (fly plane1 city3 city0)
   deleted: (at plane1 city3)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 0 to 777, (fuel plane1) from 2294 to 1517
   goals met: 1 of 4
3. (refuel plane3 city5)
   changed: (fuel plane3) from 629 to 2124
   goals met: 1 of 4
4. (fly plane3 city5 city1)
   deleted: (at plane3 city5)
   added: (at plane3 city1)
   changed: (total-fuel-used) from 777 to 1528, (fuel plane3) from 2124 to 1373
   goals met: 2 of 4
5. (fly plane1 city0 city6)
   deleted: (at plane1 city0)
   added: (at plane1 city6)
   changed: (total-fuel-used) from 1528 to 2325, (fuel plane1) from 1517 to 720
   goals met: 1 of 4
6. (refuel plane1 city6)
   changed: (fuel plane1) from 720 to 2294
   goals met: 1 of 4
7. (board person1 plane1 city6)
   deleted: (at person1 city6)
   added: (in person1 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 1 of 4
8. (board person2 plane1 city6)
   deleted: (at person2 city6)
   added: (in person2 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 1 of 4
9. (fly plane1 city6 city2)
   deleted: (at plane1 city6)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 2325 to 3174, (fuel plane1) from 2294 to 1445
   goals met: 1 of 4
10. (debark person2 plane1 city2)
   deleted: (in person2 plane1)
   added: (at person2 city2)
   changed: (onboard plane1) from 2 to 1
   goals met: 2 of 4
11. (fly plane1 city2 city0)
   deleted: (at plane1 city2)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 3174 to 4108, (fuel plane1) from 1445 to 511
   goals met: 3 of 4
12. (debark person1 plane1 city0)
   deleted: (in person1 plane1)
   added: (at person1 city0)
   changed: (onboard plane1) from 1 to 0
   goals met: 4 of 4
